backend/controllers/PlaceController.php

    public function actionDelete($id)
    {
        $gettype = Place::find()->where(['id' => $id])->one();
---
SELECT * FROM `place` WHERE `id`='64'