frontend/controllers/FileUploadListController.php

SELECT * FROM `file_upload_list` WHERE `id`='93'
---
    protected function findModel($id)
    {
        if (($model = FileUploadList::findOne($id)) !== null) {