frontend/controllers/MenuMainController.php

    protected function findModel($id)
    {
        if (($model = MenuMain::findOne($id)) !== null) {
---
SELECT * FROM `menu_main` WHERE `id`='29'