frontend/views/menu-main/index.php

SELECT COUNT(*) FROM `menu_sub` WHERE `menu_id`='24'
---
                                            <i class="<?php echo $row["m_icon"]; ?>"></i>
                                            <strong><?php echo $row["m_name"]; ?></strong> -

                                            [<?=$count = MenuSub::find()
                                                    ->where(['menu_id' => $row["id"]])
                                                    ->count();?> เมนู]