backend/views/layouts/main.php

// Start :: User Website Usaged
$actual_link = "http://$_SERVER[HTTP_HOST]$_SERVER[REQUEST_URI]";;
$active_url = str_replace("http://45.127.62.51:7000/textx/frontend/web/","",$actual_link);
$users_now = Users::find()->where("id = '".$_SESSION['user_id']."'")->one();
$unit_now = Unit::find()->where("unit_id = '".$users_now['unit_id']."'")->one();
---
SELECT * FROM `users` WHERE id = '1'
SELECT * FROM `unit` WHERE unit_id = '000'