frontend/views/file-upload-list/words_cut.php

$eform_template = "SELECT detail as dt FROM `eform` WHERE form_id = '".$model->form_id."' AND active = '1' AND unit_id = '".$_SESSION['unit_id']."'";
$eft = Yii::$app->db->createCommand($eform_template)->queryOne();
$url_node = Yii::$app->db->createCommand("SELECT setting_value FROM `setting` WHERE setting_name = 'url_node'")->queryOne();
$python_nlp  =Setting::find()->where(['setting_name' => 'python_nlp'])->one()->setting_value;

$txt_data = $model->textx_data;

$checkKeyword = RememberWords::find()->all();
---
SELECT * FROM `setting` WHERE `setting_name`='python_nlp'
SELECT * FROM `remember_words`