common/models/LoginForm.php

SELECT `id`, `role`, `name`, `user_group`, `unit_id`, `username` FROM `users` WHERE username = 'sadmin' and password = '81dc9bdb52d04dc20036dbd8313ed055'
SELECT `unit_name` FROM `unit` WHERE unit_id = '000'
---
    public function validatePassword($attribute, $params)
    {
        if (!$this->hasErrors()) {
            $user = $this->getUser();
            $check_users_status = Yii::$app->request->post('check_users_status');
            if (!$user || !$user->validatePassword($this->password)) {
                if($check_users_status==1){
                    $this->addError($attribute, 'คุณไม่มีสิทธิ์เข้าถึงระบบ เนื่องจากผู้ดูแลปิดสิทธิ์การเข้าใช้งานของคุณ');
                }else{
                    $this->addError($attribute, 'Incorrect username or password.');
                }

            }else{
                $query = User::find()
                ->select('id,role,name,user_group,unit_id,username')
                ->where("username = '".$this->username."' and password = '".md5($this->password)."'")->one();
                $unit = Unit::find()->select('unit_name')->where("unit_id = '".$query->unit_id."'")->one();