common/models/User.php

     public static function findIdentity($id)
    {
        // return static::findOne($id);
         return self::findOne(array('id'=>$id,'status'=>'1'));
---
SELECT * FROM `users` WHERE (`id`=1) AND (`status`='1')

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username,'status'=>'1']);
---
SELECT * FROM `users` WHERE (`username`='sadmin') AND (`status`='1')