backend/views/site/page-ajaxuploadfile.php

SELECT * FROM `images` WHERE `key_images`='20210720_102707'
---


if ($type == 'show') {
    	$query = Images::find()
			->where(['key_images' => $key_images])
			->all();