backend/views/place/_form.php

SELECT * FROM `provinces` ORDER BY `name_th`
---
                </option>
                <?php

                    $Provinces =  Provinces::find()
                    ->orderBy([
                        'name_th'=>SORT_ASC,
                    ])
                    ->all();