frontend/views/site/json_words_cut.php

	$lew = isset($_GET['lew']) ?  $_GET['lew'] : (isset($_POST['lew']) ? $_POST['lew'] : '');


	$sql = FileUploadList::find()->where("id = '".$file_id."'")->one();
---
SELECT * FROM `file_upload_list` WHERE id = '93'

		}
	}';

	$model = FileUploadList::findOne($file_id);
---
SELECT * FROM `file_upload_list` WHERE `id`='93'